import img1 from '../assets/obr.png';
import img2 from '../assets/ttt.png';
import img3 from '../assets/kkk.png';
import img5 from '../assets/fiffa.png';
import img6 from '../assets/obr.png'; // можно дублировать


// Хиджабы
import hid_pub_1 from '../hidjabs/hid_pub_1.png';
import hid_pub_2 from '../hidjabs/hid_pub_2.png';
import hid_pub_3 from '../hidjabs/hid_pub_3.png';
import hid_pub_4 from '../hidjabs/hid_pub_4.png';
import hid_pub_5 from '../hidjabs/hid_pub_5.png';
import hid_pub_6 from '../hidjabs/hid_pub_6.png';
import hid_pub_7 from '../hidjabs/hid_pub_7.png';
import hid_pub_8 from '../hidjabs/hid_pub_8.png';
import hid_pub_9 from '../hidjabs/hid_pub_9.png';

import hidjab_pub_2_1 from '../hidjabs/hidjab_pub_2.1.png';
import hidjab_pub_2_2 from '../hidjabs/hidjab_pub_2.2.png';
import hidjab_pub_2_3 from '../hidjabs/hidjab_pub_2.3.png';
import hidjab_pub_2_4 from '../hidjabs/hidjab_pub_2.4.png';
import hidjab_pub_2_5 from '../hidjabs/hidjab_pub_2.5.png';

import hidjab_pub_3_1 from '../hidjabs/hidjab_pub_3.1.jpg';
import hidjab_pub_3_2 from '../hidjabs/hidjab_pub_3.2.jpg';
import hidjab_pub_3_3 from '../hidjabs/hidjab_pub_3.3.jpg';
import hidjab_pub_3_4 from '../hidjabs/hidjab_pub_3.4.jpg';
import hidjab_pub_3_5 from '../hidjabs/hidjab_pub_3.5.jpg';
import hidjab_pub_3_6 from '../hidjabs/hidjab_pub_3.6.jpg';

import hidjab_4_1 from '../hidjabs/hidjab_4_1.jpg';
import hidjab_4_2 from '../hidjabs/hidjab_4_2.jpg';
import hidjab_4_3 from '../hidjabs/hidjab_4_3.jpg';

import hidjab_5_1 from '../hidjabs/hidjab_5_1.jpg';
import hidjab_5_2 from '../hidjabs/hidjab_5_2.jpg';
import hidjab_5_3 from '../hidjabs/hidjab_5_3.jpg';

import hidjab_6_1 from '../hidjabs/hidjab_6_1.jpg';
import hidjab_6_2 from '../hidjabs/hidjab_6_2.jpg';
import hidjab_6_3 from '../hidjabs/hidjab_6_3.jpg';
import hidjab_6_4 from '../hidjabs/hidjab_6_4.jpg';

import hidjab_7_1 from '../hidjabs/hidjab_7_1.jpg';
import hidjab_7_2 from '../hidjabs/hidjab_7_2.jpg';

import hidjab_8_1 from '../hidjabs/hidjab_8_1.jpg';

import hidjab_9_1 from '../hidjabs/hidjab_9_1.jpg';
import hidjab_9_2 from '../hidjabs/hidjab_9_2.jpg';
import hidjab_9_3 from '../hidjabs/hidjab_9_3.jpg';

import hidjab_10_1 from '../hidjabs/hidjab_10_1.jpg';
import hidjab_10_2 from '../hidjabs/hidjab_10_2.jpg';
import hidjab_10_3 from '../hidjabs/hidjab_10_3.jpg';
import hidjab_10_4 from '../hidjabs/hidjab_10_4.jpg';

import hidjab_11_1 from '../hidjabs/hidjab_11_1.jpg';
import hidjab_11_2 from '../hidjabs/hidjab_11_2.jpg';

import hidjab_12_1 from '../hidjabs/hidjab_12_1.jpg';




// Образы
import obraz_1_1 from '../obraz/obraz_1_1.jpg';
import obraz_1_2 from '../obraz/obraz_1_2.jpg';
import obraz_1_3 from '../obraz/obraz_1_3.jpg';

import obraz_2_1 from '../obraz/obraz_2_1.jpg';
import obraz_2_2 from '../obraz/obraz_2_2.jpg';
import obraz_2_3 from '../obraz/obraz_2_3.jpg';

import obraz_3_1 from '../obraz/obraz_3_1.jpg';

import obraz_4_1 from '../obraz/obraz_4_1.jpg';

import obraz_4_2 from '../obraz/obraz_4_2.jpg';

import obraz_5_1 from '../obraz/obraz_5_1.jpg';

import obraz_6_1 from '../obraz/obraz_6_1.jpg';

import obraz_7_1 from '../obraz/obraz_7_1.jpg';
import obraz_7_2 from '../obraz/obraz_7_2.jpg';
import obraz_7_3 from '../obraz/obraz_7_3.jpg';

import obraz_8_1 from '../obraz/obraz_8_1.jpg';
import obraz_8_2 from '../obraz/obraz_8_2.jpg';
import obraz_8_3 from '../obraz/obraz_8_3.jpg';

import obraz_9_1 from '../obraz/obraz_9_1.jpg';

import obraz_10_1 from '../obraz/obraz_10_1.jpg';
import obraz_10_2 from '../obraz/obraz_10_2.jpg';
import obraz_10_3 from '../obraz/obraz_10_3.jpg';

import obraz_11_1 from '../obraz/obraz_11_1.jpg';
import obraz_11_2 from '../obraz/obraz_11_2.jpg';
import obraz_11_3 from '../obraz/obraz_11_3.jpg';
import obraz_11_4 from '../obraz/obraz_11_4.jpg';

import obraz_12_1 from '../obraz/obraz_12_1.jpg';
import obraz_12_2 from '../obraz/obraz_12_2.jpg';

import obraz_13_1 from '../obraz/obraz_13_1.jpg';
import obraz_13_2 from '../obraz/obraz_13_2.jpg';
import obraz_13_3 from '../obraz/obraz_13_3.jpg';

import obraz_14_1 from '../obraz/obraz_13_1.jpg';

import obraz_15_1 from '../obraz/obraz_15_1.jpg';
import obraz_15_2 from '../obraz/obraz_15_2.jpg';


const productsData = [
  {
    id: 50,
    title: 'Льняная двойка',
    images: [obraz_1_3, obraz_1_2, obraz_1_1],
    description: 'В трёх базовых оттенках наша новая двойка изо льна 🥰',
    price: 3200,
    category: 'Образы',
  },
  {
    id: 52,
    title: 'Нарядная двойка',
    images: [obraz_3_1],
    description: 'Нарядная двойка — элегантный выбор для особых случаев и стильных выходов.',
    price: 3800,
    category: 'Образы',
  },
  
  {
    id: 51,
    title: 'Айвори / Белый',
    images: [obraz_2_1, obraz_2_2, obraz_2_3],
    description: 'Самое время порадовать себя модной новинкой🍭, которая потрясающе преобразит вас❣️',
    price: 3300,
    category: 'Образы',
  },
  {
    id: 56,
    title: 'Нарядная двойка',
    images: [obraz_6_1],
    description: 'Элегантная двойка, идеально подходящая для особых мероприятий и стильных выходов. Лёгкий материал и утончённый крой.',
    price: 3200,
    category: 'Образы',
  },
  {
    id: 53,
    title: 'Брюка с рубашкой',
    images: [obraz_4_1],
    description: 'Брюка с рубашкой — лёгкий и стильный образ на каждый день.',
    price: 2300,
    category: 'Образы',
  },
  {
    id: 54,
    title: 'Двойка',
    images: [obraz_4_2],
    description: 'Элегантная двойка, которая добавит стильности в ваш образ.',
    price: 3100,
    category: 'Образы',
  },
  {
    id: 55,
    title: 'Сарафан',
    images: [obraz_5_1],
    description: 'Лёгкий и стильный сарафан для тёплого сезона. Отлично подойдёт как для прогулок, так и для особых случаев.',
    price: 3700,
    category: 'Образы',
  },
  {
    id: 58,
    title: 'Тройка из хлопковой ткани',
    images: [obraz_8_1, obraz_8_2, obraz_8_3],
    description: 'Мягкая и лёгкая тройка из натурального хлопка. Комфортный фасон, дышащий материал и универсальный стиль на каждый день.',
    price: 3300,
    category: 'Образы',
  },
  
  {
    id: 57,
    title: 'Платье (Производство: Турция 🇹🇷)',
    images: [obraz_7_1, obraz_7_2, obraz_7_3],
    description: 'Стильное платье турецкого производства. Качественный пошив, современный дизайн и лёгкий материал делают его идеальным для любого случая.',
    price: 3300,
    category: 'Образы',
  },
  {
    id: 59,
    title: 'Платье в трёх расцветках',
    images: [obraz_9_1],
    description: 'Элегантное платье в базовых расцветках: чёрный, коричневый и серый. Комфортный крой и универсальный стиль для любого повода.',
    price: 2600,
    category: 'Образы',
  },

  {
    id: 60,
    title: 'Двоечка ✨💔',
    images: [obraz_10_1, obraz_10_2, obraz_10_3],
    description: 'Стильная и универсальная двоечка — лёгкий образ для любого случая. Комфорт и изящество в каждой детали.',
    price: 2900,
    category: 'Образы',
  },
  {
    id: 61,
    title: 'Качество LUX🔥',
    images: [obraz_11_1, obraz_11_2, obraz_11_3, obraz_11_4],
    description: 'Роскошный комплект премиум-качества. Идеален для особых случаев и повседневной элегантности. Ткань высокого класса, посадка безупречная.',
    price: 3600,
    category: 'Образы',
  },
  {
    id: 62,
    title: 'Двоечки',
    images: [obraz_13_1, obraz_13_2, obraz_13_3],
    description: 'Опять же универсальное, в нём хоть куда и вживую ещё прекраснее, чем на фото. 🙈 Идеально садится, подчёркивает стиль и элегантность.',
    price: 2900,
    category: 'Образы',
  },
  {
    id: 63,
    title: 'Летняя юбка',
    images: [obraz_12_1, obraz_12_2],
    description: 'На лето самое то! В этой юбке вообще не жарко 😍 Лёгкая, дышащая ткань и комфортная посадка.',
    price: 1650,
    category: 'Образы',
  },
  {
    id: 64,
    title: 'Яркая новинка',
    images: [obraz_14_1],
    description: 'Вот такая яркая новиночка у нас сегодня 💛💛💛',
    price: 2100,
    category: 'Образы',
  },
  {
    id: 65,
    title: 'Идеальное платье на весну',
    images: [obraz_15_1, obraz_15_2],
    description: 'Идеальное платье на весну 😍🌸',
    price: 2500,
    category: 'Образы',
  },
  
  
  
  
  
  
  
  





  {
    id: 4,
    title: 'Футболка Oversize',
    images: [img3, img5],
    description: 'Футболка свободного кроя. Отлично сочетается с джинсами или юбками.',
    price: 2500,
    category: 'Рубашки и футболки',
  },
  {
    id: 5,
    title: 'Пальто Классика',
    images: [img5, img2],
    description: 'Классическое пальто для холодных дней. Элегантный дизайн и теплый материал.',
    price: 8000,
    category: 'Пальто и куртки',
  },
  {
    id: 6,
    title: 'Костюм-двойка',
    images: [img6, img1],
    description: 'Универсальный костюм для деловых встреч и повседневной носки.',
    price: 9000,
    category: 'Костюмы и комбинизоны',
  },
  // Хиджабы
  {
    id: 20,
    title: 'Королевская химар 🕊',
    images: [
      hid_pub_1,
      hid_pub_2,
      hid_pub_3,
      hid_pub_4,
      hid_pub_5,
      hid_pub_6,
      hid_pub_7,
      hid_pub_8,
      hid_pub_9,
    ],
    description: 'Элегантный и утончённый химар, подчёркивающий благородство и скромность. Лёгкая ткань, роскошный вид.',
    price: 1900,
    category: 'Хиджабы',
  },
  {
    id: 21,
    title: 'Платье "Летний бриз" 🕊',
    images: [
      hidjab_pub_3_1,
      hidjab_pub_3_2,
      hidjab_pub_3_3,
      hidjab_pub_3_4,
      hidjab_pub_3_5,
      hidjab_pub_3_6,
    ],
    description: 'Легкое и воздушное платье с "летучими" рукавами. Идеальный выбор для жаркой погоды, подчеркивающее женственность и стиль. 🌸',
    price: 2300,
    category: 'Хиджабы',
  },
  {
  id: 22,
  title: 'Платья летучка 🕊',
  images: [
    hidjab_pub_2_1,
    hidjab_pub_2_2,
    hidjab_pub_2_3,
    hidjab_pub_2_4,
    hidjab_pub_2_5,
  ],
  description: 'Платья свободного кроя с "летучими" рукавами. Воздушные, легкие и женственные. Идеальный вариант для тёплой погоды. ☁️',
  price: 2100,
  category: 'Хиджабы',
},{
  id: 23,
  title: 'Двойка с накидкой',
  images: [hidjab_4_1, hidjab_4_2, hidjab_4_3],
  description: 'Элегантная двойка с лёгкой накидкой. Подходит для особых случаев и повседневной носки. Лёгкий и дышащий материал.',
  price: 2050,
  category: 'Хиджабы',
},
{
  id: 24,
  title: 'Тыкань Калифорния',
  images: [hidjab_5_1, hidjab_5_2, hidjab_5_3],
  description: 'Тыкань "Калифорния" — утончённый стиль в каждой детали. Приятная к телу ткань, изысканный фасон и воздушная лёгкость. Подчёркивает индивидуальность и скромность.',
  price: 2850,
  category: 'Хиджабы',
},
{
  id: 25,
  title: 'Льняной хиджаб',
  images: [hidjab_6_1, hidjab_6_2, hidjab_6_3, hidjab_6_4],
  description: 'Хиджаб из натурального льна — лёгкий, дышащий и невероятно комфортный в носке. Идеален для повседневного образа в тёплую погоду.',
  price: 2100,
  category: 'Хиджабы',
},
{
  id: 26,
  title: 'Абайка + сарафан (лён)',
  images: [hidjab_7_1, hidjab_7_2],
  description: 'Комплект из абайки и сарафана, выполненный из натурального льна. Дышащий материал и свободный крой обеспечивают комфорт и элегантность. Идеально для тёплого сезона.',
  price: 2300,
  category: 'Хиджабы',
},
{
  id: 27,
  title: 'Двойка с юбкой (ткань париж)',
  images: [hidjab_8_1],
  description: 'Элегантная двойка с юбкой из костюмной ткани "париж". Лёгкая, удобная и универсальная модель для повседневной носки и особых случаев.',
  price: 2500,
  category: 'Хиджабы',
},
{
  id: 28,
  title: 'Намазник с балаклавой',
  images: [hidjab_9_1, hidjab_9_2, hidjab_9_3],
  description: 'Намазник из бамбуковой ткани с пришитой балаклавой — мягкий, дышащий и удобный. Идеально подходит для молитвы и повседневного ношения.',
  price: 1650,
  category: 'Хиджабы',
},
{
  id: 29,
  title: 'Двойка Супрем',
  images: [hidjab_10_1, hidjab_10_2, hidjab_10_3, hidjab_10_4], // Здесь добавлены изображения, которые ты указал
  description: 'Стильная и удобная двойка из ткани супрем. Идеальный выбор для повседневного использования, комфортная и стильная на каждый день.',
  price: 2300,
  category: 'Хиджабы',
},
{
  id: 30,
  title: 'Двойка юбочная (двунитка)',
  images: [hidjab_11_1, hidjab_11_2], // заменишь на реальные изображения
  description: 'Двойка юбочная из ткани двунитка. Мягкий материал, универсальный фасон, подходит для повседневной носки и особых случаев. Доступна в разных цветах.',
  price: 2700,
  category: 'Хиджабы',
},
{
  id: 31,
  title: 'Хиджаб с изюминкой 🌿',
  images: [hidjab_12_1],
  description: 'Хиджаб из ткани варёнка джинс — стильный, комфортный и практичный вариант для повседневного ношения. Отлично держит форму и подчёркивает образ.',
  price: 2400,
  category: 'Хиджабы',
},

];

export default productsData;

